# Условие:
# Напишете програма, която дава възможност на потребителя да въведе лично и фамилно име на студент, студентския номер,
# резултата от текущ контрол в проценти и теглото му, както и резултата от финалния изпит в проценти и теглото му.
# Пресметнете крайния резултат по формулата:
# краен резултат = текущ контрол * тегло на текущ контрол + финален изпит * тегло на финален изпит
# Изведете името на студента, студентския номер и крайния резултат.
# Автор: [Михаил Бъжев]
# Факултетен номер: [223010031]
# Дата: 06.06.2025

# Въвеждане на данни от потребителя
full_name = input("Лично и фамилно име на студент: ")
student_number = input("Номер: ")

# Въвеждане на резултат и тегло за текущ контрол
current_result, current_weight = input("Резултат от текущ контрол в проценти и тегло: ").split()
current_result = float(current_result)
current_weight = float(current_weight)

# Въвеждане на резултат и тегло за финален изпит
final_result, final_weight = input("Резултат от финален изпит в проценти и тегло: ").split()
final_result = float(final_result)
final_weight = float(final_weight)

# Изчисляване на крайния резултат
final_score = current_result * current_weight + final_result * final_weight

# Извеждане на резултата
print(f"{full_name} ({student_number}) има краен резултат {final_score:.1f}%.")
