// 3 зад. Да се състави програма на C++, чрез която се отпечатват двойките индекси
// на всички елементи от масива, чиято стойност е по-малка от v.
// Вход:
// {79,72,13,14,15},{21,22,53,24,75},{31,57,33,34,35},{41,42,43,44,45},{59,52,53,54,55},{61,69,63,64,65}
// 14
// Изход: 0 2

#include <iostream>
using namespace std;

int main() {
    int arr[6][5];
    char ch;

    for (int i = 0; i < 6; i++) {
        cin >> ch;
        for (int j = 0; j < 5; j++) {
            cin >> arr[i][j];
            cin >> ch;
        }
        if (i < 5) {
            cin >> ch;
        }
    }

    int v;
    cin >> v;

    for (int i = 0; i < 6; i++) {
        for (int j = 0; j < 5; j++) {

            if (arr[i][j] < v) {
                cout << i << " " << j << endl;
            }
        }
    }

    return 0;
}
