# 1 зад. Да се напише програма, коят реализира следните действия:
# -	Въвежда едно цяло число n от клавиатурата и въвeжда в масив n на брой елементи.
# -	Въвежда цяло число m от клавиатурата и въвежда в масив m на брой елементи;
# -	Отпечатва YES ако броят на едноцифрените елементи в двата масива е равен и NO в противен случай;
# -	Сортира елементите на първият масив във възходящ ред, а на втория – в низходящ ред;
# -	Отпечатва сортираните масиви;
# Вход:	
# 5
# 101 2 15 78 3
# 10
# 1 47 12 130 56 4 5 58 111 811	NO
# Изход:
# NO
# 2 3 15 78 101
# 811 130 111 58 56 47 12 3 2

# Вход:	
# 12
# 1 6 4 89 2 15 111 212 56 3 14 45
# 7
# 3 2 15 4 65 5 9
# Изход:
# YES
# 1 2 3 4 6 14 15 45 56 89 111 212
# 2 3 4 5 9 15 65




# 2 зад. На поредния световен конгрес на сумистите се събрали няколко тона спортисти.
# Да се състави програма (C++), чрез която по въведено общо тегло на сумисти и тяхното средно тегло се изчислява възможния брой спортисти.
# Програмата да дава възможност потребителят да тества различни входни данни. Броят на опитите се определя от потребителя.
# Общото тегло, в тонове, е естествено число от интервала [10..99]., а средното тегло, в килограми, е реално число от интервала [120.299].
# Вход:
# 14 130
# Изход:
# 108
# Обяснение на примера: 14 тона,  130 килограма тежи средно един сумист. 



# 3 зад. В час по физическо възпитание се провежда изпит по бягане. Да се напише програма, която въвежда резултатите на децата от клавиатурата до въвеждане на 0 и извежда най-слабият резултат, най-добрият резултат и на нов ред всички резултати, подредени по големина.
# Вход: 10.08 15.02 13.23 16.44 10.12 15.23 17.15 19.23 0
# Изход: 19.23       10.08        
# 10.08 10.12 13.23 15.02 15.23 16.44 17.15 19.23 


# 4 зад. Да се състави програма, чрез която в двумерен масив, с брой колони А и брой редове B, се въвеждат псевдослучайни естествени числа от интервала [0..100]. А и В се въвеждат от клавиатурата. 
# Програмата да въведе в два други едномерни масива, поотделно само четните и нечетни въведени числа.
# Чрез функция да се изведе броя на четните и нечетни числа.
# Пример: A=5; B=6 Изход: 
# 89; 9; 5; 94; 52; 56;
# 48; 36; 62; 87; 11; 85;
# 20; 8; 47; 17; 5; 60;
# 92; 46; 26; 60; 57; 2;
# 36; 76; 38; 25; 12; 62;
# 19 четни числа: 94; 52; 56; 48; 36; 62; 20; 8; 60; 92; 46; 26; 60; 2; 36; 76; 38; 12; 62;
# 11 нечетни числа: 89; 9; 5; 87; 11; 85; 47; 17; 5; 57; 25;


# 5 зад. Организирана е среща на високо ниво. В една от залите има въртящ се бар, като всеки може да завърти плота и в двете посоки.
# Да се състави програма, която по въведени брой позиции в бара [5..20], текуща позиция на клиента и позиция на желана напитка се избира най-късия път в кръга.
# Вход:	Изход:
# 16 2 14	4

# Обяснение на примера: общ брой позиции 16, текуща 2, желана 14. Изход: плота се върти 4 позиции.
